Documents/ОбъединениеЗаписейСкладскогоЖурнала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ОбъединениеЗаписейСкладскогоЖурнала</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеПродукции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВырабатываемаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьСкладскогоЖурнала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НекачественныйГруз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультирующаяЗаписьСкладскогоЖурнала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкоропортящаясяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Comment>Истина = Объединение, Ложь   = Присоединение</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПродукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>GUIDСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписьСкладскогоЖурнала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокФизическихУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>GUIDСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеМаркировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыМаркировок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Упаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УровниУпаковок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДвижениеПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ДвижениеПродукции</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаписьСкладскогоЖурнала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ОбъединениеЗаписейСкладскогоЖурнала/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//  Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//           где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы,
//           связанного с реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	
	Возврат Результат;
	
КонецФункции

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Записывает движения регистра "ДвиженияПродукции" при обновлении на версию "2.0.7.1"
Процедура ЗаполнитьЗаписиДвиженияТоваровПриОбновлении(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбъединениеЗаписейСкладскогоЖурнала.ЗаписьСкладскогоЖурнала КАК ЗаписьСкладскогоЖурнала
		|ПОМЕСТИТЬ ВТ_ЗаписиДляСписания
		|ИЗ
		|	Документ.ОбъединениеЗаписейСкладскогоЖурнала КАК ОбъединениеЗаписейСкладскогоЖурнала
		|ГДЕ
		|	ОбъединениеЗаписейСкладскогоЖурнала.Ссылка = &Ссылка
		|	И НЕ ОбъединениеЗаписейСкладскогоЖурнала.ТипОперации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.ЗаписьСкладскогоЖурнала
		|ИЗ
		|	Документ.ОбъединениеЗаписейСкладскогоЖурнала.ТаблицаПродукция КАК ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция
		|ГДЕ
		|	ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	ВЫБОР
		|		КОГДА ДвижениеПродукцииОстатки.КоличествоОстаток < 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ВЫБОР
		|		КОГДА ДвижениеПродукцииОстатки.КоличествоОстаток < 0
		|			ТОГДА -ДвижениеПродукцииОстатки.КоличествоОстаток
		|		ИНАЧЕ ДвижениеПродукцииОстатки.КоличествоОстаток
		|	КОНЕЦ КАК Количество,
		|	ДвижениеПродукцииОстатки.Организация КАК Организация,
		|	ДвижениеПродукцииОстатки.Предприятие КАК Предприятие,
		|	ДвижениеПродукцииОстатки.ЗаписьСкладскогоЖурнала КАК ЗаписьСкладскогоЖурнала
		|ИЗ
		|	РегистрНакопления.ДвижениеПродукции.Остатки(
		|			,
		|			Организация = &Организация
		|				И Предприятие = &Предприятие
		|				И ЗаписьСкладскогоЖурнала В
		|					(ВЫБРАТЬ
		|						ВТ_ЗаписиДляСписания.ЗаписьСкладскогоЖурнала
		|					ИЗ
		|						ВТ_ЗаписиДляСписания КАК ВТ_ЗаписиДляСписания)) КАК ДвижениеПродукцииОстатки
		|";

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Организация",	ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("Предприятие",	ДокументСсылка.Предприятие);
	Запрос.УстановитьПараметр("Период",			ДокументСсылка.Дата);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		НаборЗаписей = РегистрыНакопления.ДвижениеПродукции.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписей.Записывать = Истина;
		НаборЗаписей.Очистить();
		НаборЗаписей.Загрузить(РезультатЗапроса.Выгрузить());
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		Исключение
			ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстШаблона = НСтр("ru = 'Не удалось записать движения документа по причине: %1.'");
			ТекстИсключения = СтрШаблон(ТекстШаблона, ПредставлениеОшибки);
			ЗаписьЖурналаРегистрации("Ошибка выполнения",
									 УровеньЖурналаРегистрации.Ошибка,
									 ДокументСсылка.Метаданные(),
									 ДокументСсылка,
									 ТекстИсключения);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Записывает записи движений продукции в регистр "ДвижениеПродукции"
//
// Параметры:
// СсылкаНаДокумент - ссылка на документ регистратор
Процедура ЗаписатьДвиженияПродукции(ДокументСсылка) Экспорт
	//
	//НаборЗаписей = РегистрыНакопления.ДвижениеПродукции.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	//НаборЗаписей.Очистить();
	//НаборЗаписей.Записать();
	//
	//ТаблицаДвижений = ПодготовитьТаблицуДвижений(ДокументСсылка);
	//
	//НаборЗаписей.Загрузить(ТаблицаДвижений);
	//НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПодготовитьТаблицуДвижений(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОбъединениеЗаписейСкладскогоЖурнала.ЗаписьСкладскогоЖурнала КАК ЗаписьСкладскогоЖурнала
		|ПОМЕСТИТЬ ВТ_ЗаписиДляСписания
		|ИЗ
		|	Документ.ОбъединениеЗаписейСкладскогоЖурнала КАК ОбъединениеЗаписейСкладскогоЖурнала
		|ГДЕ
		|	ОбъединениеЗаписейСкладскогоЖурнала.Ссылка = &Ссылка
		|	И НЕ ОбъединениеЗаписейСкладскогоЖурнала.ТипОперации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.ЗаписьСкладскогоЖурнала
		|ИЗ
		|	Документ.ОбъединениеЗаписейСкладскогоЖурнала.ТаблицаПродукция КАК ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция
		|ГДЕ
		|	ОбъединениеЗаписейСкладскогоЖурналаТаблицаПродукция.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбъединениеЗаписейСкладскогоЖурнала.Организация КАК Организация,
		|	ОбъединениеЗаписейСкладскогоЖурнала.Предприятие КАК Предприятие,
		|	ОбъединениеЗаписейСкладскогоЖурнала.РезультирующаяЗаписьСкладскогоЖурнала КАК ЗаписьСкладскогоЖурнала,
		|	ОбъединениеЗаписейСкладскогоЖурнала.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ЗаписьДляПрихода
		|ИЗ
		|	Документ.ОбъединениеЗаписейСкладскогоЖурнала КАК ОбъединениеЗаписейСкладскогоЖурнала
		|ГДЕ
		|	ОбъединениеЗаписейСкладскогоЖурнала.Ссылка = &Ссылка";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	Запрос.Выполнить();
	
	ЗапросДляБлокировки = Новый Запрос("ВЫБРАТЬ * ИЗ ВТ_ЗаписиДляСписания");
	ЗапросДляБлокировки.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ДанныеДляБлокировки = ЗапросДляБлокировки.Выполнить().Выгрузить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ДвижениеПродукции");
	ЭлементБлокировки.УстановитьЗначение("Организация", ДокументСсылка.Организация);
	ЭлементБлокировки.УстановитьЗначение("Предприятие", ДокументСсылка.Предприятие);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ДанныеДляБлокировки;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ЗаписьСкладскогоЖурнала", "ЗаписьСкладскогоЖурнала");
	Блокировка.Заблокировать();
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	ВЫБОР
		|		КОГДА ДвижениеПродукцииОстатки.КоличествоОстаток < 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ДвижениеПродукцииОстатки.Организация КАК Организация,
		|	ДвижениеПродукцииОстатки.Предприятие КАК Предприятие,
		|	ДвижениеПродукцииОстатки.ЗаписьСкладскогоЖурнала КАК ЗаписьСкладскогоЖурнала,
		|	ВЫБОР
		|		КОГДА ДвижениеПродукцииОстатки.КоличествоОстаток < 0
		|			ТОГДА -ДвижениеПродукцииОстатки.КоличествоОстаток
		|		ИНАЧЕ ДвижениеПродукцииОстатки.КоличествоОстаток
		|	КОНЕЦ КАК Количество
		|ИЗ
		|	РегистрНакопления.ДвижениеПродукции.Остатки(
		|			,
		|			Организация = &Организация
		|				И Предприятие = &Предприятие
		|				И ЗаписьСкладскогоЖурнала В
		|					(ВЫБРАТЬ
		|						ВТ_ЗаписиДляСписания.ЗаписьСкладскогоЖурнала
		|					ИЗ
		|						ВТ_ЗаписиДляСписания КАК ВТ_ЗаписиДляСписания)) КАК ДвижениеПродукцииОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	ВТ_ЗаписьДляПрихода.Организация,
		|	ВТ_ЗаписьДляПрихода.Предприятие,
		|	ВТ_ЗаписьДляПрихода.ЗаписьСкладскогоЖурнала,
		|	ВТ_ЗаписьДляПрихода.Количество
		|ИЗ
		|	ВТ_ЗаписьДляПрихода КАК ВТ_ЗаписьДляПрихода
		|ГДЕ
		|	ВТ_ЗаписьДляПрихода.Количество > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидДвижения";

	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Организация", ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("Предприятие", ДокументСсылка.Предприятие);
	Запрос.УстановитьПараметр("Период"     , ДокументСсылка.Дата);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
